SPedt_!/src/Documents/КорректировкаОстатков/КорректировкаОстатков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КорректировкаОстатков</name>
  <registerRecords>AccumulationRegister.ПотерянныеЗаказы</registerRecords>
  <registerRecords>AccumulationRegister.Транзит</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <attributes>
    <name>СворачиватьСПодборомПартии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Покупки</name>
    <attributes>
      <name>Участник</name>
      <type>
        <types>CatalogRef.Участники</types>
      </type>
    </attributes>
    <attributes>
      <name>Покупка</name>
      <comment>Номер покупки</comment>
      <type>
        <types>CatalogRef.Покупки</types>
        <types>CatalogRef.Заказы</types>
        <types>CatalogRef.Посылки</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Оплачен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоХранения</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>Габарит</name>
      <comment>Размер покупки</comment>
      <type>
        <types>CatalogRef.Габариты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПокупкаСпр</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DocumentRef.Движение</types>
        <types>DocumentRef.Приходная</types>
        <types>DocumentRef.ПоступлениеПристроя</types>
        <types>DocumentRef.РазборКоробки</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Транзиты</name>
    <attributes>
      <name>Точка</name>
      <type>
        <types>CatalogRef.ТочкиРаздачи</types>
      </type>
    </attributes>
    <attributes>
      <name>Участник</name>
      <type>
        <types>CatalogRef.Участники</types>
      </type>
    </attributes>
    <attributes>
      <name>ПокупкаСсылка</name>
      <type>
        <types>CatalogRef.Покупки</types>
        <types>CatalogRef.Заказы</types>
        <types>CatalogRef.Посылки</types>
        <types>CatalogRef.Коробки</types>
      </type>
    </attributes>
    <attributes>
      <name>Габарит</name>
      <type>
        <types>CatalogRef.Габариты</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоХранения</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DocumentRef.Движение</types>
        <types>DocumentRef.КорректировкаЗаписейРегистров</types>
        <types>DocumentRef.ОтправлениеТранзита</types>
        <types>DocumentRef.Приходная</types>
        <types>DocumentRef.ПоступлениеПристроя</types>
        <types>DocumentRef.РазборКоробки</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПотеряныеЗаказы</name>
    <attributes>
      <name>Посылка</name>
      <type>
        <types>CatalogRef.Посылки</types>
      </type>
    </attributes>
    <attributes>
      <name>Коробка</name>
      <type>
        <types>CatalogRef.Коробки</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерНакладной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНакладной</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПунктВыдачи</name>
      <type>
        <types>CatalogRef.ТочкиРаздачи</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SPedt_!/src/AccumulationRegisters/Транзит/Транзит.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Транзит</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ПокупкаСсылка</name>
    <type>
      <types>DefinedType.ТипыЗаказа</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Габарит</name>
    <type>
      <types>CatalogRef.Габариты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Участник</name>
    <type>
      <types>CatalogRef.Участники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Точка</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.Движение</types>
      <types>DocumentRef.ФормированиеКоробки</types>
      <types>DocumentRef.КорректировкаЗаписейРегистров</types>
      <types>DocumentRef.ОтправлениеТранзита</types>
      <types>DocumentRef.ЗаказыДляТранзита</types>
      <types>DocumentRef.Приходная</types>
      <types>DocumentRef.ПоступлениеПристроя</types>
      <types>DocumentRef.РазборКоробки</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

SPedt_!/src/AccumulationRegisters/ПотерянныеЗаказы/ПотерянныеЗаказы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПотерянныеЗаказы</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Посылка</name>
    <type>
      <types>CatalogRef.Посылки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Коробка</name>
    <type>
      <types>CatalogRef.Коробки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерНакладной</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНакладной</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПунктВыдачи</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

SPedt_!/src/Documents/КорректировкаОстатков/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура Заполнить(Команда)

	 ПолучитьОтрицательныеОстатки();
	
КонецПроцедуры


&НаСервере
Процедура  ПолучитьОтрицательныеОстатки()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиТоваровОстатки.Габарит,
		|	ОстаткиТоваровОстатки.Участник,
		|	ОстаткиТоваровОстатки.МестоХранения,
		|	ОстаткиТоваровОстатки.Покупка,
		|	ОстаткиТоваровОстатки.Партия,
		|	ОстаткиТоваровОстатки.Оплачен,
		|	ОстаткиТоваровОстатки.КоличествоОстаток,
		|	Покупки.Наименование КАК ПокупкаСпр
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваров.Остатки(&наДату, ) КАК ОстаткиТоваровОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Покупки КАК Покупки
		|		ПО ОстаткиТоваровОстатки.Покупка = Покупки.Код
		|ГДЕ
		|	ОстаткиТоваровОстатки.КоличествоОстаток < 0";
	Запрос.Параметры.Вставить("наДату",КонецДня(Объект.Дата));
	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрПокупки= Объект.Покупки.Добавить();
		СтрПокупки.Участник =  ВыборкаДетальныеЗаписи.Участник;
		СтрПокупки.Покупка =  ВыборкаДетальныеЗаписи.Покупка;
		СтрПокупки.Оплачен =  ВыборкаДетальныеЗаписи.Оплачен;
		СтрПокупки.МестоХранения =  ВыборкаДетальныеЗаписи.МестоХранения;
		СтрПокупки.Габарит =  ВыборкаДетальныеЗаписи.Габарит;
		СтрПокупки.ПокупкаСпр =  ВыборкаДетальныеЗаписи.ПокупкаСпр;
		СтрПокупки.Партия =  ВыборкаДетальныеЗаписи.Партия;
		СтрПокупки.Количество =  ВыборкаДетальныеЗаписи.КоличествоОстаток;
		
	КонецЦикла;


	
	
КонецПроцедуры



&НаСервере
Процедура  ПолучитьКоректировкуПокупок()
	

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиТоваровОстатки.Габарит,
		|	ОстаткиТоваровОстатки.Участник,
		|	ОстаткиТоваровОстатки.МестоХранения,
		|	ОстаткиТоваровОстатки.Покупка,
		|	ОстаткиТоваровОстатки.Партия,
		|	ОстаткиТоваровОстатки.Оплачен,
		|	ОстаткиТоваровОстатки.КоличествоОстаток как Количество,
		|	Покупки.Наименование КАК ПокупкаСпр,
		|	Покупки.Ссылка КАК ПокупкаСсылка
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваров.Остатки(&наДату, ТИПЗНАЧЕНИЯ(Покупка) = ТИП(ЧИСЛО)) КАК ОстаткиТоваровОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Покупки КАК Покупки
		|		ПО ОстаткиТоваровОстатки.Покупка = Покупки.Код";
	Запрос.Параметры.Вставить("наДату",КонецДня(Объект.Дата));
	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрПокупки= Объект.Покупки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрПокупки,ВыборкаДетальныеЗаписи);
		
		
		СтрПокупки= Объект.Покупки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрПокупки,ВыборкаДетальныеЗаписи);
		СтрПокупки.Покупка=ВыборкаДетальныеЗаписи.ПокупкаСсылка;
		СтрПокупки.Количество=ВыборкаДетальныеЗаписи.Количество*-1;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура КоректировкаПокупок(Команда)
	ПолучитьКоректировкуПокупок()

КонецПроцедуры


&НаСервере
Процедура ЗаполнитьТранзитыНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТранзитОстатки.Габарит,
		|	ТранзитОстатки.Участник,
		|	ТранзитОстатки.МестоХранения,
		|	ТранзитОстатки.Партия,
		|	ТранзитОстатки.ПокупкаСсылка,
		|	ТранзитОстатки.Точка,
		|	ТранзитОстатки.КоличествоОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.Транзит.Остатки(&наДату, ) КАК ТранзитОстатки
		|ГДЕ
		|	ТранзитОстатки.КоличествоОстаток < 0";
	Запрос.Параметры.Вставить("наДату",КонецДня(Объект.Дата));
	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		стрТР=Объект.Транзиты.Добавить();
		ЗаполнитьЗначенияСвойств(стрТР,ВыборкаДетальныеЗаписи);		
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьТранзиты(Команда)
	ЗаполнитьТранзитыНаСервере();
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьПотерянныеЗаказыНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПотерянныеЗаказыОстатки.Посылка КАК Посылка,
		|	ПотерянныеЗаказыОстатки.Коробка КАК Коробка,
		|	ПотерянныеЗаказыОстатки.НомерНакладной КАК НомерНакладной,
		|	ПотерянныеЗаказыОстатки.ДатаНакладной КАК ДатаНакладной,
		|	ПотерянныеЗаказыОстатки.ПунктВыдачи КАК ПунктВыдачи,
		|	ПотерянныеЗаказыОстатки.КоличествоОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.ПотерянныеЗаказы.Остатки(&наДату, ) КАК ПотерянныеЗаказыОстатки
		|ГДЕ
		|	ПотерянныеЗаказыОстатки.КоличествоОстаток < 0";
	Запрос.Параметры.Вставить("наДату",КонецДня(Объект.Дата));
	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		стрТР	= Объект.ПотеряныеЗаказы.Добавить();
		ЗаполнитьЗначенияСвойств(стрТР,ВыборкаДетальныеЗаписи);		
	КонецЦикла;

КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьПотерянныеЗаказы(Команда)
	ЗаполнитьПотерянныеЗаказыНаСервере();
КонецПроцедуры
